{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batchnormalization_1", "axis": 1, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "batch_input_shape": [null, 32, 64, 3], "momentum": 0.99, "beta_regularizer": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "nb_row": 3, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "activation": "linear", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "nb_row": 3, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "activation": "linear", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "nb_row": 3, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "activation": "linear", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 2, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "activation": "linear", "nb_col": 2, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 2, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "activation": "linear", "nb_col": 2, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "input_dim": 320, "trainable": true, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": null, "input_dim": 100, "trainable": true, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_regularizer": null, "input_dim": 50, "trainable": true, "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "input_dim": 10, "trainable": true, "init": "glorot_uniform", "name": "dense_4", "b_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null}}]}